docs/comp-sci/theorem-provers/mizar/modules.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modules in Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Modules in Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-4773abd6-b0bc-496b-9967-5ed5ca96df47">1. Introduction</a>
<ul>
<li><a href="#h-77c197aa-5dc2-43ec-a310-fb215550a166">1.1. Tensor Product of Two Modules</a></li>
<li><a href="#h-5b908863-245a-4845-819c-99a5d095ad61">1.2. Tensor Algebra</a></li>
</ul>
</li>
<li><a href="#h-0df2c6f1-8881-4bfd-97c7-9012e23f93e3">2. Map of Articles</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-4773abd6-b0bc-496b-9967-5ed5ca96df47" class="outline-2">
<h2 id="h-4773abd6-b0bc-496b-9967-5ed5ca96df47"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-4773abd6-b0bc-496b-9967-5ed5ca96df47">
<p>
Let me review all the linear algebra over rings necessary for some Lie
algebra stuff (e.g., the universal envelopping algebra for a Lie algebra).
This will require:
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Direct Sum of a family of modules</li>
<li class="off"><code>[&#xa0;]</code> Tensor Product for two modules</li>
<li class="off"><code>[&#xa0;]</code> Tensor Product for a family of modules</li>
<li class="off"><code>[&#xa0;]</code> Tensor Algebra generated by an algebra</li>
</ul>
</div>

<div id="outline-container-h-77c197aa-5dc2-43ec-a310-fb215550a166" class="outline-3">
<h3 id="h-77c197aa-5dc2-43ec-a310-fb215550a166"><span class="section-number-3">1.1.</span> Tensor Product of Two Modules</h3>
<div class="outline-text-3" id="text-h-77c197aa-5dc2-43ec-a310-fb215550a166">
<p>
The difficulty which first presents itself for thinking about the tensor
product for two modules, well, the tensor product is an Abelian
group. We need to prove \(M_{1}\otimes M_{2}\) is a module (left/right/bi,
according to the situation). Then we need to register this as a fact, or
redefine the tensor product (ugh).
</p>

<p>
I also would have to prove \(M_{1}\otimes(M_{2}\otimes M_{3}) = (M_{1}\otimes M_{2})\otimes M_{3}\)
which then establishes \(M_{1}\otimes M_{2}\otimes M_{3}\) is unambiguous.
This requires some care with the exact definition of the tensor product,
because some definitions make this an isomorphism rather than an exact
equality. 
</p>
</div>
</div>

<div id="outline-container-h-5b908863-245a-4845-819c-99a5d095ad61" class="outline-3">
<h3 id="h-5b908863-245a-4845-819c-99a5d095ad61"><span class="section-number-3">1.2.</span> Tensor Algebra</h3>
<div class="outline-text-3" id="text-h-5b908863-245a-4845-819c-99a5d095ad61">
<p>
I think we need \(R\) to be a commutative associative ring with unit, and \(M\) to
be a unitary module over \(R\). This is because \(T^{0}(M)=R\) must be an
module over \(R\), which forces us to insist on \(R\) being associative.
</p>

<p>
A unitary module \(M\) over \(R\) means:
</p>
<ul class="org-ul">
<li>For left $R$-modules, for all \(m\in M\) we have \(m\mapsto 1\cdot m\) be
the identity automorphism of \(M\)</li>
<li>For right $R$-modules, for all \(m\in M\) we have \(m\mapsto m\cdot 1\) be
the identity automorphism of \(M\)</li>
<li>For bimodules, both of these are the identity automorphism</li>
</ul>

<p>
This obviously requires \(R\) being a unital ring.
</p>

<p>
Why do we need \(R\) to be commutative? Well, if we consider
\(m_{1}\otimes m_{2}\in M\otimes M\) and \(r,s\in R\), then:
</p>

\begin{align*}
rs(m_{1}\otimes m_{2})
&=r(m_{1}\otimes(sm_{2}))\\
&=(rm_{1})\otimes(sm_{2})\\
&=s((rm_{1})\otimes m_{2})\\
&=sr(m_{1}\otimes m_{2})
\end{align*}

<p>
&#x2026;which will end up imposing commutativity on the ring, since we just proved
\(rs(m_{1}\otimes m_{2})=sr(m_{1}\otimes m_{2})\). So it's unusual to
find tensor products of modules over noncommutative rings, but we could
do it; and for the tensor algebra, it's just extra baggage we have to
eventually jettison.
</p>
</div>
</div>
</div>

<div id="outline-container-h-0df2c6f1-8881-4bfd-97c7-9012e23f93e3" class="outline-2">
<h2 id="h-0df2c6f1-8881-4bfd-97c7-9012e23f93e3"><span class="section-number-2">2.</span> Map of Articles</h2>
<div class="outline-text-2" id="text-h-0df2c6f1-8881-4bfd-97c7-9012e23f93e3">
<ul class="org-ul">
<li>In <a href="http://mizar.org/version/current/html/vectsp_2.html"><code>vectsp_2</code></a> we have a few notion of modules formalized:
<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/vectsp_2.html#NM5"><code>LeftMod of R</code></a></li>
<li><a href="http://mizar.org/version/current/html/vectsp_2.html#NM6"><code>RightMod of R</code></a></li>
<li><a href="http://mizar.org/version/current/html/vectsp_2.html#NM7"><code>BiMod of R1,R2</code></a> is a left R1-module and right R2-module</li>
</ul></li>
<li>In <a href="http://mizar.org/version/current/html/vectsp12.html"><code>vectsp12</code></a>
<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/vectsp12.html#M1"><code>VectorSpace-Sequence of K</code></a> is needed for the product of a family of
vector spaces, it's possibly infinite, and possibly empty.</li>
<li><a href="http://mizar.org/version/current/html/vectsp12.html#K7"><code>product</code></a> of a <code>VectorSpace-Sequence of K</code> yields a non-empty strict
<code>ModuleStr over K</code>. It's then registered to yield a vector space.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-08-08 Tue 11:36.</p>
</div>
</body>
</html>